Changed diagram
